{
    "inicio": "Home",
    "sobre": "About",
    "projetos": "Projects",
    "certificados": "Certificates",
    "contato": "Contact",
    "flagBrazil": "Flag of Brazil",
    "flagEua": "Flag of Estados Unidos",
    "logo": "Blue brain with the name Eduardo Aguiar next to it.",
    "name": "Eduardo Aguiar",
    "specialty": "Fullstack Developer",
    "text": "Always seeking to become a better professional, improving my skills and knowledge, and focusing on innovation and excellence in the solutions I offer. Committed to solving problems creatively and always looking for new solutions for you.",
    "download_cv": "Download CV",
    "scroll_down": "scroll down",
    "githubAlt": "GitHub icon",
    "linkedinAlt": "LinkedIn icon",
    "instagramAlt": "Instagram icon",
    "eduardoHome": "Man with a beard, leaning and smiling, with arms crossed, against a background with an octagonal image.",
    "scrollDownImg": "scroll down arrow",
    "whatsapp": "whatsapp icon",
    
    
    "aboutMeTitle": "About Me",
    "aboutP1": "Hello, I'm Eduardo, a full stack developer passionate about technology. My journey into programming began with a front-end development course at Cursos Pós Rio, where I developed skills in HTML, CSS, JavaScript and Bootstrap. Early on, I realized that this was what I wanted for my life, which led me to enroll in a Systems Analysis and Development course at Cândido Mendes.",
    "aboutP2": "I recently completed a residency in Fullstack Development at the SERRATEC Technological Park. During this program, I improved my soft skills, such as communication, teamwork and problem solving, in addition to learning various technologies, such as Node.js, React, React Native, TypeScript, Java, Spring Framework, SQL and code versioning.",
    "aboutP3": "Right after the residency, I delved deeper into the area of ​​software quality, participating in a course at the FEST institution, where I learned about manual and automated testing, the use of management tools such as Trello and backlog, creating reports, mind maps and much more.",
    "aboutP4": "Currently, I'm delving deeper into React JS studies.",
    "moreInfo": "More info",
    "eduardoAbout": "Man with a beard, leaning and smiling, with arms intertwined, on a lake background.",
    
    
    "projectsTitle": "Projects",
    "title1": "DigitalFit",
    "title2": "RetroGames",
    "title3": "Cork & Cap CO.",
    "title4": "CineHub",
    "title5": "Social Network",
    "title6": "Cities of the World",
    "title7": "Inventory API",
    "description1": "During my experience studying Software Development at the SERRATEC Technology Park, I had the opportunity to participate in the development of a training system for PWD and non-PWD people. Our system has more than 30 pages and meets all business rules, including accessibility and responsiveness. The API was developed in Java, using the Spring framework, while the frontend was implemented in React JS.",
    "description2": "During my experience in the Full Stack Software Development course at the SERRATEC Technology Park, in the Web Development with React JS discipline, I participated in the development of a project that simulated a retro game sales store in approximately 3 to 4 days, using technologies such as React, react-router-dom, styled-components, JSON Server, and JSON DB.",
    "description3": "During my experience in the Full Stack Software Development course at the SERRATEC Technological Park, in the Essential Frontend Development discipline, I participated in the development of a project that simulated a wine sales store in approximately 3 to 4 days, using mainly technologies such as HTML , CSS, JavaScript and Bootstrap.",
    "description4": "During the Full Stack Software Development course at the SERRATEC Technological Park, in the Mobile Development discipline, I participated in the development of a project that simulated a movie app. In this project, we use a movie API that provides information about movies categorized by genre, description, and rating. We use JSON Server to simulate a server and db.json to simulate a database. To navigate between pages, we use Stack Navigation and Bottom Tab. The project was developed in React Native and TypeScript.",
    "description5": "During my experience in the Full Stack Software Development course at the SERRATEC Technological Park, in the Restful API Development discipline, I participated in the development of a project that simulated a social network API using Java, Spring Framework and PostgreSQL database. For the development of the API, resources such as pagination, native queries, JPQL, error handling, documentation (Swagger), authentication and authorization, implementation of email sending, among others, were also used.",
    "description6": "During my experience in the Front-End Development course at Cursos Pós Rio, I had the opportunity to develop in class a simulation of a system with information from cities around the world, using HTML, CSS and responsive techniques to ensure that it works well in different screen sizes, offering a consistent user experience.",
    "description7": "During my experience in the Restful API Development course at Cursos Pós Rio, I developed a project in class that simulated a product stock API using JavaScript, Node.js and a PostgreSQL database. For the development of the API, resources such as migrations, error handling, authentication and authorization, among others, were also used.",
    "presentation": "Presentation",
    "repository": "Repository",
    "seeLess": "See Less",
    "seeMore": "See More",
    "digitalfitAlt": "White man, unshaven, wearing a yellow polo shirt, sitting in a wheelchair, smiling and showing his muscles.",
    "retrogamesAlt": "Login screen with the image of Mario over the pipe, smiling and waving.",
    "corkcapAlt": "Dark screen with a bottle of wine, a glass and a small text next to it.",
    "cinehubAlt": "Movies screen with a search bar and some categorized movie images.",
    "socialnetworkAlt": "Screen displaying various programming codes.",
    "worldcityAlt": "Home screen showing the city of Sydney, with the sea, some boats and, in the background, several buildings.",
    "inventoryapiAlt": "Screen displaying various programming codes.",
    
    
    "certificatesTitle": "Certificates",
    "course1": "Web Development",
    "course2": "Essential Front-End",
    "course3": "Senai Development",
    "course4": "Software Quality",
    "titleCourse1": "SERRATEC Residence",
    "titleCourse2": "Essential Front-End",
    "titleCourse3": "Full Stack Development",
    "titleCourse4": "Introduction to Software Quality",
    "descriptionCourse1": "Some time ago, I was able to complete the Fullstack Software Development course through the SERRATEC program, with a workload of 770 hours. During this program, I improved my soft skills, such as adaptability, teamwork and problem solving, in addition to learning various technologies, such as JavaScript, Node.js, React, React Native, TypeScript, Java, Spring Framework, PostgreSQL, code versioning , between others.",
    "descriptionCourse2": "My first contact with programming was through this course, where I was able to take my first steps and confirm that this was what I really wanted for myself. After completing the course, I began to delve deeper into programming and then enrolled in a higher education course in Systems Analysis and Development at Cândido Mendes. During the course, I developed skills in HTML, CSS, JavaScript and Bootstrap.",
    "descriptionCourse3": "During my experience studying Full Stack Software Development at SENAI, I was able to learn several technologies. With the best teachers, a workload of 560 hours and a duration of 5 months, it was a period of a lot of learning and a lot of effort, where I developed skills in JavaScript, Node.js, React, React Native, TypeScript, Java, Spring Framework, PostgreSQL, code versioning, among others.",
    "descriptionCourse4": "Shortly after the residency in ICT Software at SERRATEC, I decided to delve deeper into the area of ​​software quality, participating in a course at the FEST institution lasting 80 hours, where I learned about manual and automated testing, the use of management tools such as Trello and backlog , creating reports, mind maps, and much more.",
    "buttonCourse": "See more",
    "imgcourse1": "Drawing of three people typing on a large screen.",
    "imgcourse2": "Drawing of a man with a beard, wearing glasses, sitting in a chair, with a lamp next to him, typing on a notebook.",
    "imgcourse3": "Drawing of a person from behind, sitting in a chair, programming on a computer with a large screen.",
    "imgcourse4": "Drawing of two people, a man and a woman, with a magnifying glass, looking at a large screen.",
    "reactnativeicon": "react native icon",
    "javaicon": "java icon",
    "htmlicon": "html5 icon",
    "cssicon": "css3 icon",
    "javascripticon": "javascript icon",
    "typescripticon": "typescript icon",
    "nodeicon": "node icon",
    "bootstrapicon": "bootstrap icon",
    "reacticon": "react icon",
    "giticon": "git icon",
    "postgresicon": "postgres icon",
    "roboticon": "robot icon",

    
    "contactTitle": "Contact",
    "contactName": "Your full name:",
    "contactEmail": "Your email:",
    "contactPhone": "Your cell phone:",
    "contactMessage": "Your message...",
    "buttonContact": "Submit",
    "emailSuccess": "Email sent successfully!",
    "emailError": "Error sending email. Please try again.",
    "fieldEmpty": "Fill in all the fields",
    "invalidEmail": "Enter a valid email.",
    "invalidPhone": "Enter a valid phone number (numbers only, no spaces).",


    "notFound": "URL not found",
    "notFoundLink": "Click here to return to portfolio",

    "upArrow": "up arrow",
    "exclamation": "exclamation image",

    "imgtitle": "three blue bars"
}