{
    "inicio": "Início",
    "sobre": "Sobre",
    "projetos": "Projetos",
    "certificados": "Certificados",
    "contato": "Contato",
    "logo": "Cérebro azul com o nome Eduardo Aguiar ao lado.",
    "name": "Eduardo Aguiar",
    "specialty": "Desenvolvedor Fullstack",
    "text": "Sempre buscando me tornar um profissional melhor, aprimorando minhas habilidades e conhecimentos, e focando em inovação e excelência nas soluções que ofereço. Comprometido com a resolução de problemas de forma criativa e sempre em busca de novas soluções para você.",
    "download_cv": "Download CV",
    "scroll_down": "scroll down",
    "githubAlt": "ícone do GitHub",
    "linkedinAlt": "ícone do LinkedIn",
    "instagramAlt": "ícone do Instagram",
    "eduardoHome": "Homem com barba, inclinado e sorrindo, com os braços entrelaçados, sobre um fundo com uma imagem octogonal.",
    "scrollDownImg": "seta para baixo",
    "whatsapp": "icone do Whatsapp",


    "aboutMeTitle": "Sobre Mim",
    "aboutP1": "Olá, eu sou o Eduardo, um desenvolvedor full stack apaixonado por tecnologia. Minha caminhada na programação começou com um curso de desenvolvimento front-end pela Cursos Pós Rio, onde desenvolvi habilidades em HTML, CSS, JavaScript e Bootstrap. Logo no início, percebi que era isso que eu queria para minha vida, o que me levou a ingressar em um curso de Análise e Desenvolvimento de Sistemas pela Cândido Mendes.",
    "aboutP2": "Recentemente, concluí uma residência em Desenvolvimento Fullstack pelo Parque Tecnológico SERRATEC. Durante esse programa, aperfeiçoei minhas soft skills, como comunicação, trabalho em equipe e resolução de problemas, além de aprender diversas tecnologias, como Node.js, React, React Native, TypeScript, Java, Spring Framework, SQL e versionamento de código.",
    "aboutP3": "Logo após a residência, me aprofundei na área de qualidade de software, participando de um curso pela instituição FEST, onde aprendi sobre testes manuais e automatizados, uso de ferramentas de gestão como Trello e backlog, criação de relatórios, mapas mentais e muito mais.",
    "aboutP4": "Atualmente, estou me aprofundando mais nos estudos de React JS.",
    "moreInfo": "Saber mais",
    "eduardoAbout": "Homem com barba, inclinado e sorrindo, com os braços entrelaçados, sobre um fundo de um lago.",


    "projectsTitle": "Projetos",
    "title1": "DigitalFit",
    "title2": "RetroGames",
    "title3": "Cork & Cap CO.",
    "title4": "CineHub",
    "title5": "Rede Social",
    "title6": "Cidades do Mundo",
    "title7": "API de Estoque",
    "description1": "Durante minha experiência cursando Desenvolvimento de Software pelo Parque tecnológico SERRATEC, tive a oportunidade de participar do desenvolvimento de um sistema de treinamento para pessoas PCD e não PCD. Nosso sistema conta com mais de 30 páginas e atende a todas as regras de negócio, incluindo acessibilidade e responsividade. A API foi desenvolvida em Java, utilizando o framework Spring, enquanto o frontend foi implementado em React JS.",
    "description2": "Durante minha experiência no curso de Desenvolvimento de Software Full stack pelo Parque tecnológico SERRATEC, na disciplina de Desenvolvimento Web com React JS, participei do desenvolvimento de um projeto que simulava uma loja de vendas de jogos retrô em aproximadamente 3 a 4 dias, utilizando tecnologias como React, react-router-dom, styled-components, JSON Server e DB JSON.",
    "description3": "Durante minha experiência no curso de Desenvolvimento de Software Full Stack pelo Parque Tecnológico SERRATEC, na disciplina de Desenvolvimento de Frontend Essencial, participei do desenvolvimento de um projeto que simulava uma loja de vendas de vinhos em aproximadamente 3 a 4 dias, utilizando principalmente tecnologias como HTML, CSS, JavaScript e Bootstrap.",
    "description4": "Durante o curso de Desenvolvimento de Software Full Stack pelo Parque Tecnológico SERRATEC, na disciplina de Desenvolvimento Mobile, participei do desenvolvimento de um projeto que simulava um app de filmes. Neste projeto, utilizamos uma API de filmes que fornece informações sobre filmes categorizados por gênero, descrição e classificação. Usamos o JSON Server para simular um servidor e o db.json para simular um banco de dados. Para navegar entre as páginas, utilizamos o Stack Navigation e o Bottom Tab. O projeto foi desenvolvido em React Native e TypeScript.",
    "description5": "Durante minha experiência no curso de Desenvolvimento de Software Full Stack pelo Parque Tecnológico SERRATEC, na disciplina de Desenvolvimento de API Restful, participei do desenvolvimento de um projeto que simulava uma API de rede social usando Java, Spring Framework e banco de dados PostgreSQL. Para o desenvolvimento da API, também foram utilizados recursos como paginação, queries nativas, JPQL, tratamento de erros, documentação (Swagger), autenticação e autorização, implementação de envio de e-mail, entre outros.",
    "description6": "Durante minha experiência no curso de Desenvolvimento de Front-End pela Cursos Pós Rio, tive a oportunidade de desenvolver em aula uma simulação de um sistema com informações de cidades do mundo, utilizando HTML, CSS e técnicas de responsividade para garantir que ele funcione bem em diferentes tamanhos de tela, oferecendo uma experiência de usuário consistente.",
    "description7": "Durante minha experiência no curso de Desenvolvimento de API Restful pela Cursos Pós Rio, desenvolvi em aula um projeto que simulava uma API de estoque de produtos usando JavaScript, Node.js e banco de dados em PostgreSQL. Para o desenvolvimento da API, também foram utilizados recursos como migrations, tratamento de erros, autenticação e autorização, entre outros.",
    "presentation": "Apresentação",
    "repository": "Repositório",
    "seeLess": "Ver Menos",
    "seeMore": "Ver Mais",
    "digitalfitAlt": "Homem branco, com barba por fazer, vestindo uma camisa polo amarela, sentado em uma cadeira de rodas, sorrindo e mostrando os músculos.",
    "retrogamesAlt": "Tela de login com a imagem do Mario sobre o cano, sorrindo e acenando.",
    "corkcapAlt": "Tela escura com uma garrafa de vinho, uma taça e um pequeno texto ao lado.",
    "cinehubAlt": "Tela de filmes com uma barra de pesquisa e algumas imagens de filmes categorizados.",
    "socialnetworkAlt": "Tela exibindo vários códigos de programação.",
    "worldcityAlt": "Tela inicial mostrando a cidade de Sydney, com o mar, alguns barcos e, ao fundo, vários prédios.",
    "inventoryapiAlt": "Tela exibindo vários códigos de programação.",


    
    "certificatesTitle": "Certificados",
    "course1": "Desenvolvimento Web",
    "course2": "Front-End Essencial",
    "course3": "Desenvolvimento Senai",
    "course4": "Qualidade de Software",
    "titleCourse1": "Residência SERRATEC",
    "titleCourse2": "Front-End Essencial",
    "titleCourse3": "Desenvolvimento Full Stack",
    "titleCourse4": "Introdução a Qualidade de Software",
    "descriptionCourse1": "Há algum tempo atrás, eu pude concluir o curso de Desenvolvimento de Software Fullstack pelo programa SERRATEC, com uma carga horária de 770 horas. Durante esse programa, aperfeiçoei minhas soft skills, como adaptabilidade, trabalho em equipe e resolução de problemas, além de aprender diversas tecnologias, como JavaScript, Node.js, React, React Native, TypeScript, Java, Spring Framework, PostgreSQL, versionamento de código, entre outros.",
    "descriptionCourse2": "Meu primeiro contato com a programação foi através desse curso, onde pude dar meus primeiros passos e confirmar que era isso que eu realmente queria para mim. Após concluir o curso, comecei a me aprofundar mais na programação e em seguida ingressei em um curso superior de Análise e Desenvolvimento de Sistemas pela Cândido Mendes. Durante o curso, desenvolvi habilidades em HTML, CSS, JavaScript e Bootstrap.",
    "descriptionCourse3": "Durante minha experiência cursando Desenvolvimento de Software Full Stack pelo SENAI, pude aprender diversas tecnologias. Com os melhores professores, uma carga horária de 560 horas e uma duração de 5 meses, foi um período de muito aprendizado e muito esforço, onde desenvolvi habilidades em JavaScript, Node.js, React, React Native, TypeScript, Java, Spring Framework, PostgreSQL, versionamento de código, entre outros.",
    "descriptionCourse4": "Logo após a residência em TIC Software pelo SERRATEC, decidi me aprofundar na área de qualidade de software, participando de um curso pela instituição FEST com duração de 80 horas, onde aprendi sobre testes manuais e automatizados, uso de ferramentas de gestão como Trello e backlog, criação de relatórios, mapas mentais, e muito mais.",
    "buttonCourse": "Ver mais",
    "imgcourse1": "Desenho de três pessoas digitando em uma tela grande.",
    "imgcourse2": "Desenho de um homem com barba, usando óculos, sentado em uma cadeira, com uma luminária ao lado, digitando em um notebook.",
    "imgcourse3": "Desenho de uma pessoa de costas, sentada em uma cadeira, programando em um computador com uma tela grande.",
    "imgcourse4": "Desenho de duas pessoas, um homem e uma mulher, com uma lupa, olhando para uma tela grande.",
    "reactnativeicon": "icone do react native",
    "javaicon": "icone do java",
    "htmlicon": "icone do html5",
    "cssicon": "icone do css3",
    "javascripticon": "icone do javascript",
    "typescripticon": "icone do typescript",
    "nodeicon": "icone do node",
    "bootstrapicon": "icone do bootstrap",
    "reacticon": "icone do react",
    "giticon": "icone do git",
    "postgresicon": "icone do postgres",
    "roboticon": "icone do robot",

    
    "contactTitle": "Contato",
    "contactName": "Seu nome completo:",
    "contactEmail": "Seu e-mail:",
    "contactPhone": "Seu celular:",
    "contactMessage": "Sua mensagem...",
    "buttonContact": "Enviar",
    "emailSuccess": "Email enviado com sucesso!",
    "emailError": "Erro ao enviar o email. Tente novamente.",
    "fieldEmpty": "Preencha todos os campos",
    "invalidEmail": "Insira um e-mail válido.",
    "invalidPhone": "Insira um número de telefone válido (apenas números, sem espaços).",


    "notFound": "URL não encontrada",
    "notFoundLink": "Clique aqui para voltar ao portfólio",

    "upArrow": "seta para cima",
    "exclamation": "imagem de exclamação",

    "imgtitle": "três barras azuis"
  }
  